
export const  password = {reg:/^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[0,5-9]))\d{8}$/,msg:'最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符'}; //最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
export const  acount = {reg:/^[a-zA-Z0-9_]{6,16}$/,msg:'4到16位(字母，数字，下划线)'} //4到16位（字母，数字，下划线，减号） 
export const  moblephone = {reg:/^((13[0-9])|(14[5|7])|(15([0-3]|[5-9]))|(18[0,5-9]))\d{8}$/,msg:'手机号不正确'}
export const  idcard = {reg: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,msg:'身份证号码不正确'}

/*姓名  2-16汉字
固话  7-18  区号-***
地址 2-50 只能包含汉字、字母、数字
/

   

  /*      //用户名正则，
    export function   valiacount(rule, value, callback){
            const flag = acount.test(value);
            if (!flag){
                callback('4到16位（字母，数字，下划线，减号）') 
            }else{
                callback()
            }
        }
    */
    


